{"pageProps":{"data":{"author":"Dominik Andruszak","authorPhoto":"dominik-andruszak.jpeg","date":"2020-04-14T07:50:39Z","image":"ckad-header-img.jpeg","slug":"how-to-connect-jetson-nano-to-kubernetes-using-k3s-and-k3sup","summary":"Some tips and advice that can help you with your preparations.","title":"Preparing for CKAD"},"slug":"preparing-for-ckad","content":"\nWith the rising popularity of Kubernetes, a lot of engineers decide to take the Kubernetes certification exams. The CKAD exam itself is said to be a quite challenging one, so in this article I want to share my story of how I ended up taking this exam and how I prepared for it. This is of course by no means an \"exam guide\", just a couple of loose tips that are a result of exchanging info about the preparations and the exam with a couple of friends.\n\n## A bit of history - my adventure with OCJP\n\nA couple of years ago, when I was still a Java developer, I decided to take the OCJP certification. The exam was a theoretical one, so - armed with some hefty Java tomes and the documentation - I spent a couple of weeks studying and making sure that I'm prepared for even the most intricate questions.\n\n![https://i.pinimg.com/474x/9a/12/7b/9a127bd2b44dad48ae8e2195a56f1897--big-books-reading-books.jpg](https://i.pinimg.com/474x/9a/12/7b/9a127bd2b44dad48ae8e2195a56f1897--big-books-reading-books.jpg)\n\nEven though I felt that I haven't _really_ learned anything new per se (I've been working in Java for quite some time beforehand), my preparations helped me sort out the stuff that I already knew. Still, after passing the exam - apart from satisfaction, of course - I felt quite a lot of fatigue. To the point in which I was pretty sure that I didn't want to take any other tech certifications ever again. Obviously - until I started working with Kubernetes, that is.\n\n## So how's CKAD different?\n\nA couple of years has passed since my OCJP exam - I've switched projects and companies and about two years ago started working on a Kubernetes-based project as a Python developer. The application wasn't just hosted on Kubernetes, it actually utilized its API quite heavily, creating and deleting objects in the cluster left and right from within the application code. As I had absolutely no experience with Kubernetes before, debugging the more infrastructure-based issues was challenging for quite a while. I started armed with just the simple commands, like `kubectl get pods` and `kubectl logs` and - to be perfectly honest - in most cases it didn't help me all that much, since I didn't know too much about how did Kubernetes actually work. However, the more I've worked with our application, the more I've learned Kubernetes and slowly, but surely, I started to become quite efficient with debugging. I also became interested in the Kubernetes certification - in opposite to most exams that I knew, CKAD (as well as CKA) was fully practical. No multiple choice tests here, just a terminal and a list of tasks to perform within a limited time. That sounded mighty interesting, so I figured I'll give it a shot.\n\n## How does the exam look like?\n\nAs mentioned - the CKAD exam is quite different to many other certifications. Not only there's no documentation-based multiple choice test - the official documentation is available to you at all times during the exam! There's no need to memorize commands nor any YAML-snippets - after almost two years working with Kubernetes, I still double-check those pesky volume and volume mount YAML params in the documentation, just to be sure.\n\nYou can take the exam online from the comfort of your home - that means that you will need to have your webcam and microphone turned on, so the supervisor is able to verify that everything's going as it should be. That also means that you might have to do some cleaning around your work desk - but we'll get to that in a second. Last, but not least - the exam takes 2 hours. It should be just long enough to let you finish all the tasks (and also do a quick check that everything's actually done right), but short enough to keep you on your toes all throughout the exam.\n\nTo pass the exam you'll need to get a score of at least 66% - and hopefully - with these tips attaining this score will be ever so slightly easier.\n\n![https://images.ctfassets.net/rporu91m20dc/3Bg9slDkAaWwAbaj5zhjLW/be1f142b8d8c5aadd6b04c9d2b07dd13/DE_Protip_in-body.jpg](https://images.ctfassets.net/rporu91m20dc/3Bg9slDkAaWwAbaj5zhjLW/be1f142b8d8c5aadd6b04c9d2b07dd13/DE_Protip_in-body.jpg)\n\n## Knowing where to find information\n\nFirst things first - get to know the exam curriculum. It's actually a very short document listing all the knowledge and skills you'll need to pass. It might not seem like much, but it's quite helpful and also a great jump-off point to start building your study plan.\n\nWhat you'll want to get to know quite well, on the other hand, is the official documentation. As I mentioned before, it's available to you at all times during the exam - there's a catch though. The browser you're using to take the exam can only have two tabs open - one with the actual exam, the other one with the documentation. Since you won't be able to open multiple tabs with the docs to speed up your search, it's a good idea to get to know its layout. A good idea is to use the documentation as often as possible during your preparation - you'll learn how to browse and search through the docs in a natural way. Speaking of searching - that search box in the top right corner of the docs works wonders and - most probably - you'll be able to find most stuff you'll need by simply searching by object names.\n\nLast, but not least - `kubectl` comes equipped with some documentation as well. You can use `kubectl explain` to get information regarding specific fields from an object's manifest. This is a quick way to check for the type or parameter list for a specific field.\n\n```bash\n$ kubectl explain pod.spec.containers.image\nKIND:     Pod\nVERSION:  v1\n\nFIELD:    image <string>\n\nDESCRIPTION:\n     Docker image name. More info:\n     https://kubernetes.io/docs/concepts/containers/images This field is\n     optional to allow higher level config management to default or override\n     container images in workload controllers like Deployments and StatefulSets.\n```\n\n`kubectl help` on the other hand, provides information about specific kubectl commands. You can use it as a reference to quickly check the syntax and parameters. I've truncated the output in this example because it's quite lengthy.\n\n```bash\n$ kubectl help run | head\nCreate and run a particular image in a pod.\n\nExamples:\n  # Start a nginx pod.\n  kubectl run nginx --image=nginx\n\n  # Start a hazelcast pod and let the container expose port 5701.\n  kubectl run hazelcast --image=hazelcast/hazelcast --port=5701\n\n  # Start a hazelcast pod and set environment variables \"DNS_DOMAIN=cluster\" and \"POD_NAMESPACE=default\" in the container.\n```\n\nBoth `kubectl explain` and `kubectl help` let you consult the documentation (or at least - parts of it) from the exam terminal, without having to switch browser tabs to the documentation itself. If I'm being perfectly honest, during my exam I didn't _really_ use either of those commands. I think that there's actually enough time to use the online documentation. Also - if you're not well acquainted with those commands, you might actually spend more time trying to figure out _how_ to find the info you need.\n\n## Mastering the :wq\n\nThere's this age-old tweet from Lady Gaga's account, in which she apparently tries to exit Vim for the very first time. I got some good news - you only need to know Vim a little bit more to efficiently use it during the exam.\n\n![https://s3.us-west-2.amazonaws.com/secure.notion-static.com/d567a504-a50e-437a-b162-8eebd15ee554/gaga.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAT73L2G45O3KS52Y5%2F20200414%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20200414T070226Z&X-Amz-Expires=86400&X-Amz-Signature=bb478519adcf092478c0022d5ae4972d31f23d12d11930c929889f1e25ae177f&X-Amz-SignedHeaders=host&response-content-disposition=filename%20%3D%22gaga.png%22](https://s3.us-west-2.amazonaws.com/secure.notion-static.com/d567a504-a50e-437a-b162-8eebd15ee554/gaga.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAT73L2G45O3KS52Y5%2F20200414%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20200414T070226Z&X-Amz-Expires=86400&X-Amz-Signature=bb478519adcf092478c0022d5ae4972d31f23d12d11930c929889f1e25ae177f&X-Amz-SignedHeaders=host&response-content-disposition=filename%20%3D%22gaga.png%22)\n\nOne of vim's settings that might become helpful during the exam is `:set paste`. It'll preserve the formatting while copying text from outside the editor, so it might save you some YAML-reformatting while copy-pasting snippets from the documentation. And while we're on the subject of copying and pasting - you can use both _right-click - paste_ and _ctrl-shift-v_ to paste content into the exam terminal. Fun fact - on Linux, the _ctrl-shift-c_ key combination opens the browser developer tools in both Firefox and Chrome, it's worth keeping in mind.\n\nOh, and by the way, you can also change the default editor to a different one by exporting an environment variable\n\n```bash\nexport KUBE_EDITOR=\"nano\"\n```\n\nBut then again - why not take this opportunity to learn Vim? I can guarantee that it'll become useful sooner than later. You can check out the excellent Vim Adventures browser game to have a little fun while you're getting acquainted with the editor [https://vim-adventures.com/](https://vim-adventures.com/)\n\n## Creating objects with kubectl\n\n`kubectl` allows for creating some of the objects (like pods, deployments or config maps) in two ways - declarative and imperative. The declarative way is your standard, manifest-based way of creating objects whereas the imperative way allows you to create them using `kubectl` oneliners. While the declarative way is perfectly fine for day-to-day work, it takes quite a bit of time to prepare those four-part YAML manifests. During the exam you'll be working under time constraint, so the imperative oneliners might just give you those extra couple of minutes to triple-check that one task that you weren't so sure about.\n\nHere's how to create a simple pod using the imperative way and the manifest that you'd have to write to create it declaratively\n\n```bash\nkubectl run nginx --image nginx --restart Never\n\n```\n\n```bash\napiVersion: v1\nkind: Pod\nmetadata:\n  creationTimestamp: null\n  labels:\n    run: nginx\n  name: nginx\nspec:\n  containers:\n  - image: nginx\n    name: nginx\n    resources: {}\n  dnsPolicy: ClusterFirst\n  restartPolicy: Never\nstatus: {}\n```\n\nAs you can see, we were able to create the pod without having to write the whole manifest, which saved quite a bit of writing. Let's take a quick look at the curious `--restart` parameter at the end. It determines what kind of object is created by `kubectl run`\n\n- `--restart Always` creates a deployment, this is also the default behaviour when the parameter isn't specified\n- `--restart Never` creates a pod\n- `--restart OnFailure` creates a job\n\nThe same mechanism can be applied to config maps...\n\n```bash\nkubectl create configmap myconfig --from-literal VALUE1=first_value --from-literal VALUE2=another_value\n\n```\n\n```bash\napiVersion: v1\ndata:\n  VALUE1: first_value\n  VALUE2: another_value\nkind: ConfigMap\nmetadata:\n  creationTimestamp: null\n  name: myconfig\n```\n\n...as well as secrets! Please keep in mind that - because Kubernetes differentiates couple kinds of secrets - you need to specify the kind.\n\n```bash\nkubectl create secret generic mysecret --from-literal SECRET_VALUE=totally_secret\n\n```\n\nOkay, but what if I want to adjust the object before it's created in the cluster? Those `kubectl` creation commands have a `dry-run` parameter which allows for printing the object manifest to stdout or a file.\n\n```bash\n$ kubectl run mypod --image busybox --restart Never --dry-run -o yaml > mypod.yaml\n$ kubectl get pod mypod\nError from server (NotFound): pods \"mypod\" not found\n$ cat mypod.yaml\napiVersion: v1\nkind: Pod\nmetadata:\n  creationTimestamp: null\n  labels:\n    run: mypod\n  name: mypod\nspec:\n  containers:\n  - image: busybox\n    name: mypod\n    resources: {}\n  dnsPolicy: ClusterFirst\n  restartPolicy: Never\nstatus: {}\n```\n\nThe object hasn't been created in the cluster, but the whole manifest has been saved in to a file. As you probably noticed, we also used the `-o yaml` parameter in our command. It sets the command output to the YAML format and works with the creation commands, but you can fetch a manifest of an existing object as well. Again - the output is truncated for readability\n\n```bash\n$ kubectl get pod nginx -o yaml | head\napiVersion: v1\nkind: Pod\nmetadata:\n  creationTimestamp: \"2020-04-13T23:09:34Z\"\n  labels:\n    run: nginx\n  managedFields:\n  - apiVersion: v1\n    fieldsType: FieldsV1\n    fieldsV1:\n```\n\nAnother type of object that we can create in this handy, imperative way is the service. Creating it in this way also takes care of the selectors in the manifest for us. We just have to specify the object we want to _expose_ in the command and `kubectl` will take care of preparing the selectors. The example creates a service for a pod, but this method also works for deployments.\n\n```bash\nkubectl expose pod nginx --port 80 --target-port 80 --name nginx_service --type ClusterIP\n```\n\n```bash\napiVersion: v1\nkind: Service\nmetadata:\n  creationTimestamp: null\n  labels:\n    run: nginx\n  name: nginx_service\nspec:\n  ports:\n  - port: 80\n    protocol: TCP\n    targetPort: 80\n  selector:\n    run: nginx\n  type: ClusterIP\nstatus:\n  loadBalancer: {}\n```\n\nAs you can see, you can provide the ports and service type with command parameters. One thing I'd like to point out - contrary to previous commands, the name of the created service is not passed as a positional parameter after the command name. In the case of the `expose` command, the service name is passed with a `--name` command and the positional parameter is the name of the pod or deployment that you want to expose.\n\n## Some other handy kubectl commands\n\n![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/8efd2e8a-259c-4afc-b776-493888d0d6b4/maksym-kaharlytskyi-Q9y3LRuuxmg-unsplash.jpg](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/8efd2e8a-259c-4afc-b776-493888d0d6b4/maksym-kaharlytskyi-Q9y3LRuuxmg-unsplash.jpg)\n\nThere are a couple of `kubectl` commands that can help you filter and find objects that you need. For example, you can list all the labels that are assigned to objects of a specific type - and then filter them by specific labels.\n\n```bash\n$ kubectl get pod --show-labels\nNAME    READY   STATUS      RESTARTS   AGE     LABELS\nmypod   0/1     Completed   0          14s     run=mypod\nnginx   1/1     Running     0          6m40s   run=nginx\n$ kubectl get pod -l run=nginx\nNAME    READY   STATUS    RESTARTS   AGE\nnginx   1/1     Running   0          7m4s\n```\n\nYou can also list all pods from all namespaces - or just one namespace. Keep in mind that you can't get resources by name across all namespaces, so `kubectl get po nginx -A` won't work\n\n```bash\n$ kubectl get pod -A\nNAMESPACE              NAME                                         READY   STATUS      RESTARTS   AGE\nckad                   mypod                                        0/1     Completed   0          53s\nckad                   nginx                                        1/1     Running     0          7m19s\nkube-system            coredns-66bff467f8-p4btx                     1/1     Running     5          13d\nkube-system            coredns-66bff467f8-r6fwm                     1/1     Running     5          13d\nkube-system            etcd-minikube                                1/1     Running     4          13d\nkube-system            kindnet-ck2jc                                1/1     Running     5          13d\nkube-system            kube-apiserver-minikube                      1/1     Running     4          13d\nkube-system            kube-controller-manager-minikube             1/1     Running     4          13d\nkube-system            kube-proxy-snfhd                             1/1     Running     4          13d\nkube-system            kube-scheduler-minikube                      1/1     Running     4          13d\nkube-system            nginx-ingress-controller-6d57c87cb9-g4gd9    1/1     Running     4          13d\nkube-system            storage-provisioner                          1/1     Running     7          13d\nkubernetes-dashboard   dashboard-metrics-scraper-84bfdf55ff-9nqps   1/1     Running     4          13d\nkubernetes-dashboard   kubernetes-dashboard-bc446cc64-xfjf6         1/1     Running     6          13d\n$ kubectl get pod -n kube-system\nNAME                                        READY   STATUS    RESTARTS   AGE\ncoredns-66bff467f8-p4btx                    1/1     Running   5          13d\ncoredns-66bff467f8-r6fwm                    1/1     Running   5          13d\netcd-minikube                               1/1     Running   4          13d\nkindnet-ck2jc                               1/1     Running   5          13d\nkube-apiserver-minikube                     1/1     Running   4          13d\nkube-controller-manager-minikube            1/1     Running   4          13d\nkube-proxy-snfhd                            1/1     Running   4          13d\nkube-scheduler-minikube                     1/1     Running   4          13d\nnginx-ingress-controller-6d57c87cb9-g4gd9   1/1     Running   4          13d\nstorage-provisioner\n```\n\nSpeaking of namespaces, the command switching your current `kubectl` context to a different namespace might become handy during the exam, though it's a bit unintuitive at first glance. Actually, maybe at second and third glance as well.\n\n```bash\nkubectl config set-context --current --namespace kube-system\n```\n\nFinally, for all you optimisation fans - you can use shortened names in `kubectl` commands for many of the resource types.\n\n- `kubectl get po` for pods\n- `kubectl get cm` for config maps\n- `kubectl get deploy` for deployments\n- `kubectl get svc` for services\n- `kubectl get ns` for namespaces\n\nAlso - tab based completion should work for both resource names, as well as resource types.\n\n## During the exam - last notes\n\nA couple of paragraphs above I mentioned that the ability to take this exam online from your home might mean that you'll need to do some cleaning on your desk. You can find the specifics on how to prepare your room in the CKAD information, but the two things that seem the most important - you must be alone in the room and the only thing on your desk should be your computer. Be aware of that, as the exam supervisor will probably ask you to pan your webcam across the room.\n\n![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/a88dd715-98de-4031-8366-aa535ef05a6e/alexandar-todov-AMzC2RVurO4-unsplash.jpg](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/a88dd715-98de-4031-8366-aa535ef05a6e/alexandar-todov-AMzC2RVurO4-unsplash.jpg)\n\nTime management during the exam is quite important - and while I realize it's probably the most repeated advice when it comes to time-constrained exams, I think that it's one worth repeating. If you get stuck on a task, move on - there are still probably a couple of tasks that you'll solve right away, you'll be able to give that hard one another shot later. Solve the tasks that seem easy to you first - and then start taking care of the \"thinkers\".\n\nSomething you might not be preparing for all that much (but you probably should) are connection problems. And I'm not even talking about being prepared \"technologically\" - your ISP connection can drop, the exam server might have a hiccup - and there's not much you can really do to prevent that. What you can do, however, is be mindful that this kind of occurrence might... well... occur. It will probably take you right out of your \"zone\" and even though you don't lose the minutes you were offline (your supervisor extends your exam time) it can take a moment before you'll get back to business. This will always be surprising, but if you're aware that it might happen, it might have a lesser impact on your final performance during the exam.\n\n## Final words\n\nI hope that this article will help you in your preparations and during the exam. Remember to prepare well and practice your `kubectl` kata, as the exam will test your real life Kubernetes skills (or at least - as close to real life as you can get in a laboratory test environment). Good luck!\n\n## References\n\n### Official resources\n\n- Kubernetes documentation [https://kubernetes.io/docs/home/](https://kubernetes.io/docs/home/)\n- CKAD exam page [https://www.cncf.io/certification/ckad/](https://www.cncf.io/certification/ckad/)\n- Kubectl cheat sheet [https://kubernetes.io/docs/reference/kubectl/cheatsheet/](https://kubernetes.io/docs/reference/kubectl/cheatsheet/)\n\n### Tools for local Kubernetes development\n\n- Minikube [https://github.com/kubernetes/minikube](https://github.com/kubernetes/minikube)\n- K3s [https://github.com/rancher/k3s](https://github.com/rancher/k3s), k3sup [https://github.com/alexellis/k3sup](https://github.com/alexellis/k3sup)\n- MicroK8s [https://github.com/ubuntu/microk8s](https://github.com/ubuntu/microk8s)\n\n### Other resources\n\n- Marko Luksa \"Kubernetes in Action\" [https://www.manning.com/books/kubernetes-in-action](https://www.manning.com/books/kubernetes-in-action)\n- KodeKloud Training \"Kubernetes Certified Application Developer\" [https://www.udemy.com/course/certified-kubernetes-application-developer/](https://www.udemy.com/course/certified-kubernetes-application-developer/)\n"},"__N_SSG":true}